src/cf/Catalogs/инт_ПодписчикиHTTP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПодписчикиHTTP</Name>
			<Comment>Подписчики для отправки по произвольному HTTP</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эндпоинт</Name>
					<Comment>HTTP-сервер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
					<Comment>Обработчики по кодам HTTP-ответа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Comment>BSL-код обработчика</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_ПодписчикиHTTP/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиHTTP (Модуль менеджера)
// Подписчики для отправки по произвольному HTTP
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует сообщение для отправки
//
// Параметры:
//  ДанныеСообщения - Соответствие - Данные для сериализации
//  Подписчик - СправочникСсылка.инт_ПодписчикиHTTP - Ссылка на подписчика
//  ИдентификаторСообщения - УникальныйИдентификатор - УИД сообщения
//
// Возвращаемое значение:
//  Строка - Сериализованное сообщение
//
Функция СформироватьСообщение(ДанныеСообщения, Подписчик, ИдентификаторСообщения) Экспорт
    
    Возврат инт_КоннекторHTTP.ОбъектВJson(ДанныеСообщения);
    
КонецФункции

// Отправляет сообщение подписчику
//
// Параметры:
//  Сообщение - Структура - Данные сообщения (ИдентификаторСообщения, Подписчик, СформированноеСообщение, ИдентификаторПотока)
//  ОтложенныеДействия - Соответствие - Для пакетной обработки
//
Процедура ОтправитьСообщение(Сообщение, ОтложенныеДействия) Экспорт
    
    Подписчик = Сообщение.Подписчик;
    
    СтруктураПараметровСоединения = Справочники.инт_Эндпоинты.СтруктураПараметровСоединения(Подписчик.Эндпоинт);
    
    // Формируем URL с учётом способа передачи параметров
    URL = СформироватьURL(Подписчик, Сообщение.ИдентификаторСообщения, Сообщение.ИдентификаторПотока);
    Заголовки = СформироватьЗаголовки(Подписчик, Сообщение.ИдентификаторСообщения, Сообщение.ИдентификаторПотока);
    
    Ответ = инт_КоннекторHTTP.Post(URL, Сообщение.СформированноеСообщение, Заголовки, СтруктураПараметровСоединения);
    
    // Постобработка по коду ответа
    ВыполнитьПостПроцессинг(Подписчик, Ответ);
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьURL(Подписчик, ИдентификаторСообщения, ИдентификаторПотока)
    
    URL = Подписчик.Эндпоинт.АдресРесурса;
    
    // Добавляем параметры в URL при необходимости
    ПараметрыЗапроса = Новый Массив;
    
    Если Подписчик.СпособПередачиИдентификатораСообщения = Перечисления.инт_СпособыПередачиПараметровПоHTTP.ПараметрЗапроса Тогда
        ПараметрыЗапроса.Добавить("messageId=" + Строка(ИдентификаторСообщения));
    КонецЕсли;
    
    Если Подписчик.СпособПередачиИдентификатораПотока = Перечисления.инт_СпособыПередачиПараметровПоHTTP.ПараметрЗапроса Тогда
        ПараметрыЗапроса.Добавить("flowId=" + Строка(ИдентификаторПотока));
    КонецЕсли;
    
    Если ПараметрыЗапроса.Количество() > 0 Тогда
        Разделитель = ?(СтрНайти(URL, "?") > 0, "&", "?");
        URL = URL + Разделитель + СтрСоединить(ПараметрыЗапроса, "&");
    КонецЕсли;
    
    Возврат URL;
    
КонецФункции

Функция СформироватьЗаголовки(Подписчик, ИдентификаторСообщения, ИдентификаторПотока)
    
    Заголовки = Новый Соответствие;
    Заголовки.Вставить("Content-Type", "application/json");
    
    Если Подписчик.СпособПередачиИдентификатораСообщения = Перечисления.инт_СпособыПередачиПараметровПоHTTP.Заголовок Тогда
        Заголовки.Вставить("X-Message-ID", Строка(ИдентификаторСообщения));
    КонецЕсли;
    
    Если Подписчик.СпособПередачиИдентификатораПотока = Перечисления.инт_СпособыПередачиПараметровПоHTTP.Заголовок Тогда
        Заголовки.Вставить("X-Flow-ID", Строка(ИдентификаторПотока));
    КонецЕсли;
    
    Возврат Заголовки;
    
КонецФункции

Процедура ВыполнитьПостПроцессинг(Подписчик, Ответ)
    
    КодСостояния = Ответ.КодСостояния;
    
    // Поиск обработчика по коду ответа в ТЧ ПостПроцессинг
    Для Каждого СтрокаПостПроцессинга Из Подписчик.ПостПроцессинг Цикл
        Если СтрокаПостПроцессинга.КодСостояния = КодСостояния Тогда
            // Выполнение BSL-кода обработчика
            Выполнить(СтрокаПостПроцессинга.Обработчик);
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

#КонецОбласти
